Revit 2027 API
BuiltInFailures.SketchFailures.NotOneCCWLoop Property
 This sketch defines more than one footprint. Make sure the sketch contains only one outermost loop and that there are no loops inside inner loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotOneCCWLoop { get; }
Public Shared ReadOnly Property NotOneCCWLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotOneCCWLoop {
	FailureDefinitionId^ get ();
}
static member NotOneCCWLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace